Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70N19.PIC
      <edc:SFRDef edc:_addr="0x40004024" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SSC_THR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDAT" edc:desc="Transmit Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40004028" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40004030" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="SSC_RSHR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RSDAT" edc:desc="Receive Synchronization Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004034" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SSC_TSHR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TSDAT" edc:desc="Transmit Synchronization Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004038" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SSC_RC0R" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CP0" edc:desc="Receive Compare Data 0" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000403C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SSC_RC1R" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CP1" edc:desc="Receive Compare Data 1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004040" edc:access="--------------rr----rrrr--rr--rr" edc:cname="SSC_SR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmit Empty" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:desc="Compare 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:desc="Compare 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:desc="Transmit Sync" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:desc="Receive Sync" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmit Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receive Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004044" edc:access="--------------------wwww--ww--ww" edc:cname="SSC_IER" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmit Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:desc="Receive Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:desc="Compare 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:desc="Compare 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:desc="Tx Sync Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:desc="Rx Sync Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004048" edc:access="--------------------wwww--ww--ww" edc:cname="SSC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmit Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:desc="Receive Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:desc="Compare 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:desc="Compare 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:desc="Tx Sync Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:desc="Rx Sync Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000404C" edc:access="--------------------rrrr--rr--rr" edc:cname="SSC_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmit Empty Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:desc="Receive Overrun Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:desc="Compare 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:desc="Compare 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:desc="Tx Sync Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:desc="Rx Sync Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40004050" edc:offset="0x94"/>
      <edc:SFRDef edc:_addr="0x400040E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="SSC_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x535343"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
